laukik-hase/esp-matter/examples/light/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

# ESP-TEE demo
CONFIG_SECURE_ENABLE_TEE=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_MBEDTLS_TEE_SEC_STG_ECDSA_SIGN=y

# Reducing TEE IRAM, DRAM and STACK sizes
CONFIG_SECURE_TEE_IRAM_SIZE=0x5000
# 14.5KB
CONFIG_SECURE_TEE_DRAM_SIZE=0x3A00
# 2KB
CONFIG_SECURE_TEE_STACK_SIZE=0x800
# Disable TEE logging
CONFIG_SECURE_TEE_DEBUG_MODE=n
# Disabling ATTESTATION
CONFIG_SECURE_TEE_ATTESTATION=n

# Disable the DS Peripheral support
CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=n

# Use DAC Provider implementation which reads attestation data from secure cert partition
CONFIG_SEC_CERT_DAC_PROVIDER=y

# Enable some options which reads CD and other basic info from the factory partition
CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER=y
CONFIG_ENABLE_ESP32_DEVICE_INSTANCE_INFO_PROVIDER=y
CONFIG_FACTORY_COMMISSIONABLE_DATA_PROVIDER=y
CONFIG_FACTORY_DEVICE_INSTANCE_INFO_PROVIDER=y

CONFIG_DEVICE_VENDOR_ID=0xFFF2
CONFIG_DEVICE_PRODUCT_ID=0x8001
CONFIG_CHIP_FACTORY_NAMESPACE_PARTITION_LABEL="fctry"
